# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [57]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [58]:
ser1 = pd.Series(np.random.randint(1,5,size=100))
ser2 = pd.Series(np.random.randint(1,4,size=100))
ser3 = pd.Series(np.random.randint(10000,30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [59]:
df = pd.concat([ser1,ser2,ser3],axis=1)
df

    0  1      2
0   3  3  12012
1   3  1  23741
2   3  1  11806
3   3  1  17217
4   1  1  10148
.. .. ..    ...
95  3  3  12402
96  4  3  21500
97  1  1  26347
98  3  3  20358
99  3  1  21985

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [60]:
df = df.rename(columns = {0:"bedrs",1:"bathrs",2:"price_sqr_meter"})
df

    bedrs  bathrs  price_sqr_meter
0       3       3            12012
1       3       1            23741
2       3       1            11806
3       3       1            17217
4       1       1            10148
..    ...     ...              ...
95      3       3            12402
96      4       3            21500
97      1       1            26347
98      3       3            20358
99      3       1            21985

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [71]:
bigcolumn = pd.concat([ser1,ser2,ser3] ,axis = 0)
bigcolumn = bigcolumn.to_frame()
bigcolumn = bigcolumn.rename(columns={0:"bigcolumn"})

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [72]:
bigcolumn.tail()

    bigcolumn
95      12402
96      21500
97      26347
98      20358
99      21985

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [73]:
bigcolumn.reset_index()

     index  bigcolumn
0        0          3
1        1          3
2        2          3
3        3          3
4        4          1
..     ...        ...
295     95      12402
296     96      21500
297     97      26347
298     98      20358
299     99      21985

[300 rows x 2 columns]